app/Controllers/Artikel.php

    public function index()
    {
        $pager = \Config\Services::pager();
        $keyword = $this->request->getVar('q');

        $db = \Config\Database::connect();
        $builder = $db->table('artikel');
        $builder->select('artikel.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($keyword) {
            $builder->like('artikel.judul', $keyword);
        }

        $builder->orderBy('artikel.id', 'DESC');

        $data = [
            'title'   => 'Daftar Artikel',
            'artikel' => $builder->get()->getResultArray(),
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC

            ]);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        helper(['form']);
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul'  => 'required',
            'isi'    => 'required',
            'gambar' => 'uploaded[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]|max_size[gambar,2048]'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $filename = null;

            if ($file && $file->isValid() && !$file->hasMoved()) {
                $filename = $file->getRandomName();
                $file->move(ROOTPATH . 'public/uploads', $filename);
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
                'gambar'      => $filename,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
---
SELECT *
FROM `kategori`
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`, `id_kategori`) VALUES ('niiiiyu', 'apaaja', 'niiiiyu', '1750841197_36de3cad25b853c6b0ec.jpg', '1')

    public function edit($id)
    {
        helper(['form']);
        $artikel = new ArtikelModel();
        $dataLama = $artikel->find($id);

        if (!$dataLama) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $validation = \Config\Services::validation();
        $rules = [
            'judul' => 'required',
            'isi'   => 'required',
        ];

        $file = $this->request->getFile('gambar');
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $rules['gambar'] = 'uploaded[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]|max_size[gambar,2048]';
        }

        $validation->setRules($rules);
        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '14'
SELECT *
FROM `kategori`

                }
            }

            $artikel->update($id, [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'gambar'      => $filename,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
---
UPDATE `artikel` SET `judul` = 'narutooooo', `isi` = 'aw', `gambar` = '1750841244_90e27936bc819554cd92.jpg', `id_kategori` = '3'
WHERE `artikel`.`id` IN ('14')